[
  {
    "productID": 1,
    "manufacturer_id": "486200",
    "url": "https://truealgae.com",
    "extractedData": {
      "textData": "TrueAlgae\nCulture of Innovation\n \nProducts\n \nFAQs\n \nNews & Resources\n \nAbout Us\n \nContact\nMETABOLITES ON A MISSION\nWe use algae to produce unique metabolites, tailored to the needs of agriculture and beyond\nEarth-Friendly Algae Factory\n\nOur simply elegant production system is scalable, modular and closed-looped, providing a natural, sustainable, organic and efficient way to produce microalgae-based metabolites.\n\nLearn more\n\n\n\n\nFrom Cultivation\n\nOur simply elegant technology is scalable, modular and closed-looped, providing a safe, natural, organic and efficient way to produce microalgae-based metabolites.\n\nLearn more\nSmall but Mighty Molecules\n\nThese tiny molecules, metabolites, are compounds every living organism produce to support their own health and productivity.\n\nLearn more\n\n\n\n\nTo Utilization\n\nFrom feeding the soil to feeding the world, to cleaning our air and our water, algae offer a multitude of opportunities to address global challenges\n\nLearn more\nIT’S ALL ABOUT THE MICROBIOME\nMicroorganisms live in a world of chemical signals. Metabolites help with the communication from cell to cell, regulating their environment and controlling the function and shape of much of the world’s biodiversity.\n\nLearn more\n\n\n\n\nWhile Helping the Planet\n\nGrowing in our unique system, algae takes CO2 and converts it to oxygen, creating products that can naturally nourish the soil and bring health and sustenance to humans and animals.\n\nLearn more\n\nHuman Nutrition\n\nAgriculture\n\nNew Applications\n\nAnimal Feed\n\nFind Out How We Are Using Metabolites\n\nWe work with farmers, providing metabolites to nourish the soil and improve nutrient uptake in plants. We are developing ways to use these same metabolites in feed, food and nutritional supplements.\n\nLearn more\nTrueAlgae\nCulture of Innovation\nProducts\nFAQs\nNews & Resources\nAbout\nContact\nFacebook\nTwitter\nLinkedIn\nInstagram\n\n©2025. GreenTech Ventures, Inc.| Privacy Policy"
    }
  },
  {
    "productID": 2,
    "manufacturer_id": "459510",
    "url": "https://execfuel.com.au",
    "extractedData": {
      "textData": "Skip to Content\nEMPWRHER™️ PROGRAM\nEMPWRHER™️ PROGRAM WEBINAR\nSERVICES\nBLOG\nFUEL\nMY STORY\nLOGIN\nBOOK A CALL NOW\nEXECFUEL™\nBY KAREN ARONEY\n\nImprove your\n\nhealth.\n\n\n\n\nnutrition.\n\n\n\n\nmood.\n\n\n\n\nperformance.\n\n\n\n\nlife.\n\n\n\n\nAt ExecFuel™, we believe that optimal nutrition is the cornerstone of achieving high performance in both career and personal life. We understand the demands faced by business owners, executives, and corporate professionals, and our mission is to empower them to reach their full potential through strategic, personalized nutrition.\n\nOUR MISSION\n\nTo provide specialist, tailored nutrition strategies and support that enable busy professionals to use food as fuel, optimizing their energy levels and performance. We strive to help our clients achieve their health and fitness goals without resorting to fads, self-sabotage, restriction, or deprivation.\n\nWe aim to revolutionize the way busy professionals approach their nutrition, helping them look and feel their best while excelling in their careers and personal lives. By integrating personalized nutrition strategies into their daily routines, we enable our clients to stay focused, become more agile, and feel stronger both physically and mentally. This positive transformation extends beyond individual well-being, enhancing family dynamics, career success, and overall life satisfaction.\n\nTHE IMPACT\n\nOur impact is multifaceted. Clients experience a significant boost in their energy levels, mental clarity, and physical strength. This positive transformation not only enhances their professional performance but also enriches their personal lives, including family dynamics and fitness routines. At ExecFuel™, we turn health goals into reality, fostering a holistic improvement in quality of life.\n\nOUR CULTURE\n\nExecFuel™ is built on a foundation of innovation, empathy, and excellence. We pride ourselves on creating a supportive and motivational environment where clients feel understood and empowered. Our approach is unconventional but effective, emphasizing the integration of nutrition into your lifestyle rather than imposing rigid, unsustainable rules.\n\nOUR STRATEGY\n\nOur strategy centers around delivering high-quality, personalized nutrition support predominantly through online consultations. This approach allows us to cater to clients with limited time, providing them with the flexibility and convenience they need. We focus on practical, evidence-based nutrition practices that are easy to implement and yield quick, sustainable results.\n\nBOOK YOUR FREE CALL TODAY\nFREE WEBINAR\nTHE WELLNESS BLUEPRINT FOR HIGH-ACHIEVING WOMEN\n11AM DECEMBER 7TH [AEDT]\n\nA Free Class for High-Achievers Who Want to Feel Strong, Empowered and in Control.\n\nIn just 60 minutes, discover the 3 powerful strategies busy women use to reclaim their health, boost energy, and elevate confidence.\n\nCLAIM MY FREE SEAT NOW!\nHI, I’M KAREN ARONEY\n\nA registered nutritionist with a background in psychology and the founder of ExecFuel™️ and EMPWRHER™️. I’ve spent years working as a corporate professional and entrepreneur, so I understand first-hand the unique challenges that come with balancing a high-pressure career, personal responsibilities, and maintaining your health.\n\nAfter struggling with my own health issues—like fluctuating energy, weight gain, and emotional eating—I created the ExecFuel VIP 1:1 Program & the EMPWRHER Women’s Group Program to help people just like you. My passion is to provide people with the personalized support they need to break free from unhealthy cycles, take control of their well-being, and build the confidence to excel in all areas of their lives.\n\nTogether, we can create sustainable habits that not only help you look and feel your best but also give you the energy and strength to thrive in your career and personal life.\n\nWelcome to EMPWRHER™️ – Your Path to Lasting Health and Empowerment\n\nAt EMPWRHER™, we believe that optimal health isn’t just about looking good—it’s about feeling strong, energized, and confident in every aspect of your life. Our mission is to empower high-achieving women like you to take control of your health, energy, and well-being, enabling you to show up powerfully in both your personal and professional life.\n\nWhether you're navigating the pressures of a demanding career, juggling family responsibilities, or facing the hormone challenges of perimenopause or menopause, EMPWRHER is here to guide you through a life-changing transformation. Our tailored programs are designed to help you achieve sustainable weight management, optimize energy levels, overcome emotional eating, and build long-term healthy habits.\n\nHow We Transform Lives Our program is built on three pillars of transformation:\n\nNutrition: A personalized approach to fueling your body, optimize your energy levels and give you the energy and stamina to thrive without restrictive diets.\n\nMindset: Break free from self-sabotaging behaviors and develop a mindset of resilience, self-compassion, and success.\n\nLifestyle: Build sustainable health habits that last beyond the program, helping you thrive in all areas of your life.\n\nThese pillars form the foundation for achieving balance in your life so that you can perform at your best—mentally, physically, and emotionally. Our holistic approach doesn’t just transform your health; it enhances every aspect of your life, from your career to your family relationships.\n\nReady to Take the Next Step? Join the movement of empowered women taking control of their health and performance. Book a discovery call today and secure your spot on the waitlist for the next opening of the EMPWRHER Program. Let's work together to unlock your full potential.\n\nLEARN MORE\ne-books\nQUICK VIEW\nOptimize Your Health During Perimenopause & Menopause e-book\nA$49.00\n \nQUICK VIEW\nThe Ultimate Guide To Staying Healthy During Work Travel\nA$29.00\nRECENT ARTICLES\nUnleashing Peak Performance: How Nutrition Can Transform Your Energy, Focus, and Fitness\n \nWEBINAR: The wellness blueprint for high-achieving women\n \nFueling Your Life: How to Build Lasting Habits Beyond Willpower\n \nWEBINAR: Mastering Nutrition & Fitness in Perimenopause & Menopause\n \nThe Three Pillars of Lasting Transformation: Your Blueprint for Health and Well-Being\n \ncreating a ‘nutrition vision’ that works\n \nCortisol and increased weight gain\n \nWhy ‘Cheat Meals’ Won’t Work For You\n \nHow High Achievers can manage their nutrition to win in Life and in Business\n \nBreaking Emotional Eating Behaviour\n \nIntegrating nutrition into your lifestyle\n \nTiming your meals. How this can increase & maintain energy levels.\nVIEW ARTICLES\nFUEL\nVIEW RECIPES\nLET'S CHAT\nJOIN OUR NEWSLETTER: PRACTICAL, EASILY APPLICABLE, SUSTAINABLE NUTRITION ADVICE DELIVERED TO YOUR INBOX.\n\nSubscribe to receive nutrition-related matters about once a month, and it's generally packed with info, promotions, and freebies!  \n\n SIGN UP\n\nThis website is for informational purposes only and is no way intended as medical counselling or medical advice. Results may vary.\n\nCopyright © 2024 ExecFuel™\n\nUse of ExecFuel™ is subject to our Terms of Sale, Privacy Policy, and Website Terms of Use.\n\nHome\nMy Story\nFuel\nBlog\nServices\nContact\nBOOK A CALL NOW"
    }
  },
  {
    "productID": 3,
    "manufacturer_id": "446060",
    "url": "https://freshology.com",
    "extractedData": {
      "textData": "MYFRESHOLOGY | BLOG | HELP | CONTACT\nHOME  |  LEARN MORE  |  MENUS  |  PRICING\nORDER NOW\n 800-743-7546\nSave 20% Off\nYour First Week\n\n\nRanked #1 Overall Delicious, Healthy Meals Delivered\nGET STARTED\nOffer valid for new customers only. Limitations or exclusions may apply.\nPERSONALIZE\nYOUR MENU\n\nPick your favorite meals, switch plans, pause or start whenever you like online.\n\nWE COOK &\nDELIVER\n\nFrom our chef kitchen to your plate. Delivered right to your door.\n\nHEAT & EAT\nIN 2-3 MIN\n\nYour delicious meals are ready-to-eat in just 2-3 minutes, with no prep required!\n\nENJOY\n& REPEAT!\n\nEnjoy the convenience of automatic weekly delivery. Pause or cancel any time.\n\nIT ALL STARTS\nWITH GREAT FOOD\nNo more stressful planning, preparing or\ntime wasted shopping. Just choose from\none of our award-winning menus\nand customize a plan to fit your taste and\nyour lifestyle. We'll take care of the rest.\n4 DELICIOUS MENUS TO CHOOSE FROM\nVIEW\n\nBALANCE\nMENU\nVIEW\n\nBALANCE\nDIABETES\nMENU\nVIEW\n\nKETO-CARB30\nMENU\nVIEW\n\nVEGETARIAN\nFOOD SAFETY\n& QUALITY\n\nFrom food sourcing to meal delivery, Freshology adheres to the highest food safety standards and best practices in our government-inspected commercial kitchens. We utilize the most stringent sanitation procedures available so that you can be confident your meals are clean and safe to eat.\n\nLEARN MORE\nSEE RESULTS\n\nGo ahead, get inspired by our customers' amazing stories.\n\n   \nSUCCESS STORIES\nJOIN THE THOUSANDS\nEATING HEALTHIER\nWITH FRESHOLOGY\nMEAL DELIVERY\n\nNo matter what your weight-loss and healthy living\ngoals, Freshology can help you achieve them. * From\nour delicious, healthy and portion-controlled meal\nplans to our expert support staff and tools, we\nhave over 30 years of experience helping people\njust like you reach their goals. *\n\nSave 20% Off\nYour First Week\nLET’S GET STARTED !\nORDER NOW\n* Weight loss results may vary. Results not guaranteed.\nGet Our Free Newsletter\nGet free support to help you on\nyour weight loss journey!\n\n\nSIGNUP\nGet Your Free Diet Analysis\n\n\n\nHeight\nHeight\n4' 7\"\n4' 8\"\n4' 9\"\n4' 10\"\n4' 11\"\n5' 0\"\n5' 1\"\n5' 2\"\n5' 3\"\n5' 4\"\n5' 5\"\n5' 6\"\n5' 7\"\n5' 8\"\n5' 9\"\n5' 10\"\n5' 11\"\n6' 0\"\n6' 1\"\n6' 2\"\n6' 3\"\n6' 4\"\n6' 5\"\n6' 6\"\n6' 7\"\n6' 8\"\n6' 9\"\n6' 10\"\n6' 11\"\n7' 0\"\nActivity Level\nActivity Level\nNo Exercise\nLightly Active\nModerately Active\nVery Active\nExtra Active\nGender\nGender\nMale\nFemale\n\n\n\n\nAre you looking for a Keto Meal Plan?\nAre you Diabetic or Pre-Diabetic?\nLearn More\nKeto Diet\nDiet-to-Go Reviews\nDiabetes Menu\nSuccess Stories\nDiscount Programs\nAbout Us\nAbout Us\nGuarantee\nFood Safety\nTerms of Service\nPrivacy Policy\nPartnerships\nPartner Program\nOnline Affiliate Program\nCorporate Wellness\nResources\nHelp\nContact Us\nDiet-to-Go Blog\nFree Diet Analysis\nCustomers\nMenu Management\nUpdate Plan\n  \nCopyright 2025 Diet-To-Go©"
    }
  },
  {
    "productID": 4,
    "manufacturer_id": "437129",
    "url": "https://alliedconstruction.com",
    "extractedData": {
      "textData": "Skip to Content\nHome\nRoofing\nSiding\nGutters\nContact Us\nRequest Free Inspection\nLocally Owned\nRoofing, Siding, Gutters\nand Windows\nRequest Free Inspection\nAllied Construction is proud to have served the Black Hills since 2013.\n\nWe are a locally owned and operated company with deep ties to western South Dakota. We are proud of our community and we pledge to continue to put it and its residents first. Allied Construction endeavors to provide 100% customer satisfaction. Our NO MONEY DOWN policy reflects that commitment. Call us today for a free, no obligation quote.\n\nAt Allied Construction, we were here yesterday, we are here today and we will be here for you tomorrow.\n\nRoofing\nSiding\nGutters\nWindows\nNew Ownership\n\nAllied Construction has been serving and employing the Black Hills community since 2013.\n\nOwnership recently changed in 2021 and was purchased by Josh and Lindsey Nolan of Rapid City. Together, they promise to build upon Allied's previous eight years of success and continue to grow the business into the best restoration company in the Black Hills.\n\nWe specialize in storm restoration on both residential, and commercial properties. We are well trained and educated on the latest insurance industry software and pricing systems.\n\nRoofing - Siding - Gutter's - Windows and Door's\n\nAllied Construction is open year-round. Our Project Managers, and office staff are also full time Black Hills residents.\n\nWe would like to thank you for the last eight years of success, and promise to deliver the value, and overall customer experience that every homeowner deserves.\n\nBBB Accredited\n\nTrust and Integrity are the foundation of our business. We are proud to carry an A+ rating with the Better Business Bureau. \n\nContact Us\nDon't miss out\n\nSign up with your email address to receive news on giveaways and specials\n\n Sign Up\n\n645 W Jackson Blvd, Spearfish, SD 57783   |   (605) 923-8701   |   info@alliedconstruction.com\n\nbuilt by: creative hook"
    }
  },
  {
    "productID": 5,
    "manufacturer_id": "464992",
    "url": "https://currangroup.com",
    "extractedData": {
      "textData": "Skip to content\nPortal\nHome\nAbout Us\nSubsidiaries\nMergers & Acquisitions\nContact Us\nCurran Group\nIn the business of building businesses.\nAbout Us\nGet in Touch\nPowering business for over 100 years.\nWe partner with our employees, customers, and suppliers as they are an integral part of our business and success.\n\nAs in family, the foundation of these relationships is driven by respect and integrity.\n\nSubsidiaries\nThree highly differentiated businesses - all market leaders in their own spaces.\nCurran Contracting\nCrystal Lake, Illinois\n\nCurran Contracting, a leader in infrastructure projects in suburban Chicago for nearly a century, specializes in full-site development, including demolition, excavation, remediation, materials supply, project management, and asphalt paving. We emphasize sustainability by using recycled materials and participating in the Illinois Road Builders Association's Sustainability Council.\n\nLearn More\nHolland LP\nCrete, Illinois\n\nHolland delivers innovative and sustainable rail industry solutions. We engineer, sell, and operate unique flash-butt welding equipment in North America and numerous countries across the globe. We also design, manufacture, sell, and operate track testing equipment, rail maintenance equipment, and load securement devices. Holland partners with customers to improve efficiency, safety, and sustainability in rail transport.\n\nLearn More\nGlobal Finishing Solutions\nOsseo, Wisconsin\n\nGlobal Finishing Solutions designs paint booths and finishing equipment for flawless finishes. Serving the aerospace, automotive, and industrial sectors, Global Finishing Solutions provides equipment, training, and service to boost productivity and protect health. We support our equipment with lifelong service and a nationwide network of distributors that provides controlled environments for finishing and high-quality processes.\n\nLearn More\nDriven by a set of unwavering core values.\nFamily\nWe partner with our employees, customers, and suppliers as they are an integral part of our business and success. As in family, the foundation of these relationships is driven by respect and integrity. Putting people first, supporting them in achieving and flourishing, and celebrating their accomplishments has always been a cornerstone of Curran Group’s continued growth and success. The people who work for and do business with Curran Group are part of an environment where they have every opportunity to thrive.\nRespect\n\nAt Curran Group, we never forget that every business decision impacts people’s lives. Our “people-first” culture means that we extend respect, fairness, professionalism and courtesy to each of our employees, and to our customers, business associates and vendors. The way we listen, communicate, and act reflects this commitment. \n\nPartnership\n\nWe work side by side with our business partners, setting and striving for shared goals, aligning our core values and recognizing expertise. Collaborating to bring out everyone’s strengths — that’s how the best work gets done at Curran Group.\n\nIntegrity\n\nWe abide by an ethical code of honesty and transparency that never goes out of fashion or changes. For more than a century, we’ve built a reputation of unwavering integrity. This is more than corporate speak - this is who we are at Curran Group\n\nImprovement\n\nContinuous, ongoing improvement today drives tomorrow’s success. We have the resources to invest in our affiliate companies to nurture and develop employees. We constantly plan and innovate to shape the long term and create a future that is even brighter than today.\n\nJoin Our Team\nConnect with Us\nContact Us\nHome\nAbout Us\nSubsidiaries\nMergers & Acquisitions\nContact Us\nOffice\n\nAddress: 286 Memorial Court\nCrystal Lake, IL 60014\nPhone: (815) 455-5100\nEmail: info@currangroup.com\n\nCopyright 2025 Curran Group All rights reserved.\n "
    }
  },
  {
    "productID": 6,
    "manufacturer_id": "442601",
    "url": "https://freezingpoint.co",
    "extractedData": {
      "textData": "\t\nHOME \nICE CREAM\n \nMOCKTAILS\n \nNITROPOPS\n \nCORPORATE\n \nMEDIA\n CONTACT US\n\n\n\n\nThe Freezing Point\n\nCaptivating Your Guests With A Luxury Dessert Catering Experience\n\nABOUT US\n\nWe’re here to make your event unforgettable! Most of your guests have likely never experienced fresh nitrogen ice cream made right before their eyes or held a smoking mocktail in their hands—making it the perfect way to create that WOW moment everyone will remember.\n\nWe take pride in every detail, from our customized GlowLuxe Bars that seamlessly match your branding or event theme to the elegant cups we serve in—all thoughtfully designed to elevate your event.\n\nAnd the best part? Our desserts are crafted with premium, in-house recipes that truly set us apart.\n\nVIDEO\nWEDDINGS-CORPORATE-BIRTHDAYS-GALAS-CONVENTIONS-WEDDINGS-CORPORATE-BIRTHDAYS-GALAS-CONVENTIONS-WEDDINGS-CORPORATE-BIRTHDAYS-GALAS-CONVENTIONS-WEDDINGS-CORPORATE-BIRTHDAYS-GALAS-CONVENTIONS-\nWEDDINGS - CORPORATE - BIRTHDAYS - GALAS - CONVENTIONS -\nMOCKTAILS\n\nMOCKTAILS CATERING\n\nLooking to elevate your next mocktail hour with something truly unique? The Freezing Point brings your vision to life with cutting-edge technology, creating a stunning smoky effect that lasts 3 to 5 minutes—perfect for breaking the ice and leaving a lasting impression on your guests.\n\nNo matter the size of your event, we have mocktail packages to suit every occasion.\n\nClick below to explore our mocktail offerings and find the perfect package for your event.\n\nLEARN MORE\nICE CREAM\n\nICE CREAM CATERING\n\nNitrogen ice cream isn’t just for show—it’s pure indulgence. The flash-freezing process creates tiny ice crystals, resulting in a velvety smooth texture that’s unmatched by traditional scoops. Plus, our flavors are made from scratch with high-quality ingredients and no preservatives.\n\nThe result? A perfect combination of nitrogen magic and fresh, premium ingredients.\n\nClick below to learn more about bringing our interactive Ie Cream dessert station to your next event or explore our current flavor offerings.\n\nLEARN MORE\n\nSWEET TREATS\n\n\n\nSWEET TREATS CATERING\n\nLooking to add something extraordinary to your next event? The Freezing Point’s Sweet Treats Catering offers a one-of-a-kind experience with our Smoking Macarons and Dragon’s Breath Gourmet Popcorn.\n\nOur Smoking Macarons deliver a delicate crunch with a cool, smoky effect that captivates your guests, while our Dragon’s Breath Popcorn adds an interactive twist—letting guests blow \"smoke\" with every bite!\n\nClick below to explore our sweet treats offerings and elevate your event with an extraordinary dessert experience.\n\nLEARN MORE\nCUSTOMIZED QUOTE\n\n“I’ve never seen so many people rush to a dessert bar.”\n— Cheri M, Wedding Planner\n“The ice cream was delicious! In fact, it was the only think I ate the entire night! I wanted to go back for more. Everyone was very impressed!”\n— Kathy P, Daughters Birthday\n“You guys were excellent, and your ice cream was so good! Our hospitality event was a success because of you and your energy. We will be back next year!”\n— Marie H, Coca-Cola Bottling co\n“All I can say is that our people loved your ice cream.”\n— Executive Assistant\nDESSERT CATERING PRICING\n\nEvery event is unique, so we customize our dessert catering services to elevate your vision. All desserts are freshly made for each event using our in-house recipes. To get an idea of our pricing, our one-of-a-kind nitrogen dessert catering experience ranges from $9.35 - $12.85 per person plus a set up fee for events smaller than 175 Guests. (Example Estimates: 50 guests $1250 | 200 guests $2,570).\n\nOur team is dedicated to captivating your guests, delivering an unforgettable experience, and serving extraordinary flavors. Let’s make your celebration spectacular with The Freezing Point's interactive dessert catering\n\nCLICK HERE TO GET YOUR CUSTOM QUOTE\nTOP\nEMAIL BLOG CUSTOM QUOTE VIDEO\n\nFollow our Instagram and get event ideas @FreezingPoint.us\n\nInfo@freezingpoint.co                (949) 464-7557‬\nClick Here To Contact Us For A Quote!\n\n   ‪We Cater - No storefront. Available in most states."
    }
  },
  {
    "productID": 7,
    "manufacturer_id": "467380",
    "url": "https://coachingfounder.com",
    "extractedData": {
      "textData": "Templates\nWritten Resources\nAbout\nServices\nFAQs\nGet In Touch\nOutsmart the Problems. Outperform the 99%. Win.\nI’m the tactical coach for the leaders who are hungry and ready to win. I balance emotional intelligence with razor-sharp strategy, helping you move faster, lead with clarity, and win on your own terms.\nLearn About Regina\nFree Operational Resources\nTrusted by Leaders and Top Organizations\nCoaching Top Operators Creating Impact\nNick Bell\nCEO of Fanatics Live and Fanatics Collect, former VP at Snap Inc.\nRy Walker\nCEO of Tembo, prev. Founder/CEO/CTO at Astronomer ($213m Series C company)\nKyla Scanlon\nAuthor of “In This Economy?”, contributor to Bloomberg, WSJ, and NPR’s Planet Money\nWho’s Regina Gerbeaux?\n\nFounder and operator, turned executive coach.\n\nI was the first Chief of Staff and COO to Matt Mochary, coach to the CEOs at OpenAI, Scale AI, Flexport, Coinbase, Reddit, and more. My operational write-ups are featured in the Mochary Method Curriculum as key resources for every founder ready to scale their company, and used by hundreds of fast-scaling companies.\n\nI work with the Top 1% of Leaders. When we work together, you stop flying blind. Every problem you bring to the table, I pattern-match against decisions I’ve seen decacorn companies make behind closed doors—so you avoid the mistakes they’ve already made. If you’ve ever wished there was a Stack Overflow for scaling company challenges, it exists. It lives in my brain.\n\nNot only will you have the information to make smart decisions, but I’ll also help you understand the psychology behind everyone you work with. Whether it's your leadership team, customers, or board, you’ll become a master communicator, able to bring people into your corner and win.\n\nGet to know me\nExecutive Coaching that 1% Leaders Love\n\nDon’t take my word for it - take theirs. Here are just a few of the things founders and leaders have said about what it’s like working with me:\n\n“Regina transformed my ideas into an actionable plan. She quickly grasps every task, skipping the Kumbaya fluff while still making me feel fully supported. Our chemistry was great, and I always leave with a clear plan—not a long to-do list—to help us achieve our goals.”\n\nNick Bell\nCEO of Fanatics Live and Fanatics Collectibles\n\n“Regina is the best operator in the entire world, and she’s a machine. She has the greatest bias towards action I have ever seen. And she is an excellent coach - founders love working with her so much, they volunteer to give her 1% of their company with the value she generates for them. I highly recommend her work.”\n\nMatt Mochary\nExecutive Coach to CEOs at OpenAI, Scale AI, Sequoia, Benchmark, Coinbase, Reddit, and more\n\n“Regina’s coaching is exceptional. She asks the hard questions with compassion and listens intently. She is my first call whenever I need support in navigating challenging interpersonal conflict and difficult business decisions. Founders and executives will be better off partnering with her.”\n\nChris Grouchy\nCo-Founder and President of Convictional (YCW19)\n\n“Thank you thank you! Regina, I've worked with a number of executive coaches before, and this was the best experience I've had. You efficiently manage letting me vent with a relentless focus on forward progress and action, while sharing relevant personal anecdotes to draw out insights. I walked away from an hour with you thoroughly pumped up and focused.”\n\nYifan Zhang\nManaging Director at AI2 Incubator, Former Founder of Loftium (acquired by Flyhomes)\n\n“Regina has been one of the most influential voices in my life over the past year. She has pushed me to overcome so much fear and self-doubt. When I come to her with a problem, we have an action plan in less than an hour. I have been able to have tough conversations and make big decisions like my book launch with her support and guidance. I am a completely different person (and a much better founder) thanks to her.”\n\nKyla Scanlon\nContributor to Bloomberg, WSJ, and NPR’s Planet Money, and Author of “In This Economy?”\n\n“I've known Regina for over half a decade. Working with her is like finding the missing puzzle piece you didn't know you needed. Regina brings both clarity and fire, transforming leadership from running a company to truly leading it. Her ability to pinpoint challenges and unlock breakthroughs is unreal, taking founders from reactive to thriving. I wish I'd had Regina while building my last company. If you're serious about scaling yourself and your company, working with her is a no-brainer.”\n\nAfraj Gill\nExecutive in Residence at C100 and Partner at On Deck\n\n“Regina keeps me accountable and challenges my assumptions. She calls me out when I'm not being honest with myself. She's committed to real, meaningful growth, pushing me to reflect on my core beliefs and align my actions with my values. Regina tackles hard truths head-on. Her understanding of people extends to company psychology - from fundraising to hiring and team management. Regina's insights go beyond just people skills. She's helped me craft compelling narratives for investors and refine my company's internal messaging. If you want to be challenged and grow, Regina will be your fiercest advocate and toughest critic. That's exactly what a founder needs.”\n\nDara Ledjevarian\nFounder of Delphi.ai (backed by Founders Fund)\n\n\"I originally met Regina while looking for vetted coaches for my portfolio founders/CEOs, but soon found myself regularly soliciting her counsel on different topics. Before I knew it, it organically evolved into a formal coaching relationship. Her ikigai really is helping others find their ikigai. Regina is extremely adept at coaching people on how to identify what matters to them and make decisions accordingly. Highly recommend her to any Founder/CEOs.\"\n\nNakul Patel\nGTM Advisor at Gradient AI and Big Sur AI, prev. VP of Sales at mmhmm ($139M total raised; Sequoia-backed)\n\n“Regina exemplifies Radical Candor, combining deep personal care with direct, transformative feedback. Her genuine interest in my well-being creates a safe space for growth. Drawing from her success as a profitable company founder and extensive coaching experience with high-caliber entrepreneurs, she adeptly identifies patterns and blind spots, often anticipating my needs with empathy and humility.”\n\nEllen Choi\nCo-Founder and CIO of Aiwyn AI (Series A)\n\n“Regina is like a superhero for start-up executives. She parachuted into a major leadership crisis at our company, immediately diagnosed the points of friction between our founders, and crafted a plan for resolving our interpersonal challenges. She has remarkable pattern recognition from her own professional background and a real talent for bringing unspoken root cause issues to the surface.”\n\nTheo Ellis\nCEO and Founder of Friday Harbor AI\n\nReady to get started?\n\nGet In Touch\nSee More\nCoaching for Leaders Ready to Dominate\nTrusted by CEOs and leaders at companies backed by:\nEarly Stage Founders (Pre-Seed to Series A)\n\nThis is the moment when your foundation will either make or break your company.\n\nTogether, we will work on the fundamental building blocks of relentlessly tunnel-visioning towards Product-Market Fit, hiring the right people and firing the wrong ones fast, and setting up scaffolding for “good-enough” structure where you can still move fast without breaking too many things\n\nLearn More\nGrowth & Late Stage Founders (Series B and Beyond)\n\nYou've gotten insane traction, your customers love you, and you’re growing crazy fast. It’s time for your 1 → 100 partner.\n‍\nWe’ll work on how you can eliminate the silos of information inside and between your leadership teams and across departments, manage your investors and board, and learn how to build your next products while still growing the existing one to create your moat.\n\nLearn More\nOffsites and Conflict Resolution\n\nAt every stage of company building, your team will make or break your company. The best founders leverage offsites to build better relationships with their leadership teams and reach crystal-clear alignment, and they recognize that conflict resolutions must happen frequently to quash any drama in the leadership team.\n\nTo do this, you need an expert in human emotion and psyche to come in and help with facilitation. This is how we work together.\n\nLearn More\nReady to Unlock Your Edge? Let's Connect.\n\nI take on a small number of new clients each month and frequently have a waiting list. To see if we’re a good fit, please get in touch and I’ll reach out with next steps.\n\nGet In Touch\nResources for Leaders to Move Fast and Win\n\nFree, downloadable operational templates on Notion to help you scale your company – from onboarding/offboarding, to action trackers to keep your team efficient and accountable.\n\nTemplates\nWrite-Ups\nMaster Task Board Template\nExecs, use this template with your Chief of Staff or EA to keep track of all tasks they're working on at any given time.\nMeeting Template for 1-1s\nUse 1-1s as an opportunity to manage up and show your manager that you are a hustler and self-directed.\nConflict Resolution Kit\nThis kit gives you everything you need to resolve conflict amicably between co-founders, teams, and across skip levels.\nSee All Templates\nTemplates\nWritten Resources\nAbout\nServices\nFAQs\nGet In Touch\n© 2024 Regina Gerbeaux. All rights reserved.\nMade with 💛 by Slam Media Lab"
    }
  },
  {
    "productID": 8,
    "manufacturer_id": "479616",
    "url": "https://pharmasr.com",
    "extractedData": {
      "textData": "Skip to Main Content\n\nAbout\n\nSponsors\n\nPatients\n\nOur Staff\n\nClinical Trials\n\nFAQ\n\nArticles\n\nContact\n\nWelcome to PharmaSouth Research, where our mission is to successfully conduct clinical trials while helping improve our patient’s lives.  We strive for pharmaceutical transparency based on professionalism, accuracy and assertiveness. \n\nPATIENTS\nSPONSORS\n\nSafety is our priority\n\nWork ethic is our brand\n\nQuality is our \ncommitment\n\nAbout\nSponsors\nPatients\nOur Staff\nClinical Trials\nFAQ\nArticles\nContact\n\nPharmaSouth Research\n\n2530 SW 87th Avenue\n\nMiami, FL 33165\n\nTel: 305-280-7305\n\nFax: 866-314-8665\ninfo@pharmasr.com\n\n©2022 PharmaSouth Research. Proudly created by Design of Miami Enterprises"
    }
  },
  {
    "productID": 9,
    "manufacturer_id": "471920",
    "url": "https://tallpoppy.com",
    "extractedData": {
      "textData": "How it WorksAbout UsContact UsBlog\nResources\nSign In\nHow it WorksAbout UsContact UsBlog\nResources\nSign In\nMake digital safety the company culture.\n\nStop online harassment from escalating to hacking.\n\nHow it Works\nTrusted By\nAdd cutting-edge digital safety to your organization’s benefits offerings.\n\nWhen malicious trolls target your organization, your employees take the brunt of the resulting threats, slander, and vitriol.\nWhen those trolls escalate to hacking, your employees are the most visible targets.\n\nTall Poppy helps keep your employees safe from external cybersecurity and harassment threats.\nThe safer your employees are, the safer the whole organization will be.\n\nSecurity awareness training\nStep-by-step guidance for setting up safeguards\nIncident response and follow-up support\nCrisis response resources\nSocial listening and hate site monitoring\n\n\nRisk Assessment\n\n\nRequest a Demo\nYour employee says they’re being harassed online. What do you do?\n\nMaybe it’s because your organization got bad press.\nMaybe it’s because of who your employee is.\nWhatever the reason, they need help.\n\nTall Poppy has the expertise in inclusion, HR, and security to provide support, with no strain to your HR and security teams. We’ll guide your employees through proactive risk management. If the worst happens and someone’s attacked online, our team will be on standby with decades of experience in incident response.\n\nRequest a Demo\nI need help.\nI'm being harassed online!\n\nWe know how hard this is, but you’re not alone. Our anti-harassment resources are a great starting point, and we can help you talk to your boss to get the support and safeguards you need at work.\n\nContact Us\nMy employee is being harassed online!\n\nWe've created a guide to help managers navigate this difficult situation. Tall Poppy can help your employee regain their well-being and do their best work.\n\nGet the manager's guide\nWhat people are saying\nEllen K. Pao\nProject Include Co-Founder,\nformer Reddit CEO\nWe can do something about it. We can do plenty.\n\n“Anyone can be a victim of online harassment. When I ran Reddit, I called @hypatiadotca when our employees were being doxed and targeted. Recently she and @lgdean founded @tallpoppyhq to help all companies keep their employees safe.”\n\nAnita Sarkeesian\nExec Director @femfreq & @gameshotline\nOne of the best automated, self help, online systems I've seen so far.\n\n\"If you work for a company, recommend that they sign up for @tallpoppyhq to safeguard all their employees. It’s honestly one of the best automated, self help, online systems I’ve seen so far.\"\n\nKatherine Maher\nFormer CEO of Wikimedia\nWould recommend and use again, for everyone.\n\n\"[Big] ups to @tallpoppyhq for being there to walk me through this confusing landscape, and helping me my loved ones stay safe. Would recommend and use again, for everyone.\"\n\nLiz Lee\nVC, former Twitter, OnlineSOS, and Morgan Stanley\nBig fan of the work Tall Poppy is doing.\n\n\"...big fan of the work @hypatiadotca is doing at @tallpoppyhq to solve this issue for newsrooms, other employers, and everyday individuals.\"\n\nFAQ\nWhat is online harassment?\n\nOnline harassment is the targeted abuse of a victim through internet channels such as email, messaging apps, and social media. Harassment might come from a single attacker or many. It often includes impersonation, defamation, and trolling. Harassers frequently threaten to expose sensitive personal information and make scary threats.\n\nWhat’s a Tall Poppy?\n\nTall poppies are people who stand out in their field — the people who tend to get cut down. Anyone who attracts attention for their work, their opinions, or their identity is at risk of being targeted for harassment.\n\nWhat is personal digital safety?\n\nPersonal digital safety is a set of practices and behaviors to prevent online harassment from escalating to offline daily life. It's an ongoing process that includes password management, authentication strategies, timely support, access to legal resources, and more.\n\nIt’s just online. What’s the big deal?\n\nOnline harassment can escalate to offline threats as well. Victims deal with a barrage of insults and threats of physical violence. They face increased risk of identity theft, stalking, and swatting.\n\nNo one constantly in survival mode can thrive. Without support, your employee can’t be their best whether they’re at home or at work. They’ll suffer from extreme distraction and anxiety. They might miss work. They might lose faith in themselves and the organization. They might quit.\n\nBy taking a proactive approach to digital safety, Tall Poppy minimizes the threat of online harassment. And if the worst happens and your employees are attacked, they’ll have the peace of mind that they have the resources to fight back and stay safe.\n\nProtect your team from online harassment, fraud and social engineering.\n\nGet in touch today\nResources\nGeneral Resources\nResources for Therapists\nCareers\nTerms of Use\nPrivacy Policy\nCookie Policy\nWant to hear from us?\nContact Us\nRequest a Demo\nNewsletter Signup\nAlso visit us on:\nLinkedIn\nMastodon\nInstagram\nFacebook\nTikTok\nTwitter\nTall Poppy App\nSign In\nCopyright © 2025 Tall Poppy."
    }
  },
  {
    "productID": 10,
    "manufacturer_id": "471031",
    "url": "https://1st-straw.com",
    "extractedData": {
      "textData": "HOME\nSERVICES A\nABOUT A\nBLOG\nPORTFOLIO\nCONTACT\nCATALOG\nCANNABIS SPECIALTIES\n\n\nCall for Info: 609-472-1667\n \n\n\nTake Your Brand to Places You Cannot Go!\nSmall Business Marketing - Big Business Ideas\nBetter Marketing Ideas\nCreate Better Results\n\nWelcome to 1st Straw Marketing & Promotions. If you’re looking for a comprehensive marketing plan or program to generate results, you’ve come to the right place. With years of experience delivering measurable results, 1st Straw Marketing & Promotions has professional and comprehensive marketing solutions that are perfect for your business. We specialize in business analysis, marketing solutions, and consulting services.\n\nCraft Messages\nthat Resonate\n\nIncite action with four principle message strategies: relevance, simplicity, clarity, and consistency.\n\nPlan, Stage, Market &\nPromote an Event\n\nOur expertise can help you attract new customers and promote your business or event.\n\nDesign &\nProduce Projects\n\nImprove lead generation, convert leads to sales, improve brand visibility, and increase website traffic.\n\nImprove Fundraising for Non-\nProfit Organizations\n\nWe build upon your vision to form an individual and effective marketing plan\n\n\"Craft Messages That Resonate\"\n \n     \n\n©2024-2026 1st Straw Marketing & Promotions"
    }
  },
  {
    "productID": 11,
    "manufacturer_id": "423483",
    "url": "https://shop.batiexport.com",
    "extractedData": {
      "textData": "Global Delivery, Fast & Free Shipping with DHL Express, UPS and FEDEX/TNT.\nPayment Methods\n \nAbout Us\nContact\nUSD\nMEMBER LOGIN\nSIGN UP\nMY CART\nHome Page\nAutomotive\nMachinery\nEnergy\nElectronics\nPackaging\nMarine\nPrevious\nNext\n  \n\n\n\n\n\n\n\nBest Sellers\nWalnut Huller Standard Speed 170 Liters\n$1,042\nView Item \nNew Item\nWalnut Huller Toshiba (Fuji) Speed Limiter 170 Liters\n$1,406\nView Item \nNew Item\nWalnut Cracker\n$1,250\nView Item \nFree Shipping\nNew Item\nVibrope Walnut, Pecan, Olive, Plum, Almond, Chestnut, Apricot, Mulberry Cherry and Apple Tree Harvester (Worldwide Shipping with Fedex)\n$1,450\n$1,525\nView Item \n%5 Sale\n%5Sale\nFree Shipping\nNew Item\nItem on Offer\nSpedo High Speed Tree Shaker\n$44,796\nView Item \nNew Item\nWalnut Transport Band\n$2,917\nView Item \nNew Item\n180ED Walnut Peel Adjustable Speed Paring Machine\n$2,709\nView Item \nNew Item\nFAN80 Hazelnut Cracking Machine\n$1,375\nView Item \nNew Item\nECO Interrow Hoer with Anchor+Quad Harrow+Closure Set\n$3,438\nView Item \nNew Item\nOut of stock\nCSUN 320-72P Polycrystalline Solar Panel Set\n$960\nNew Item\nZaxe X2 3D Printer (Worldwide Free Shipping with Fedex)\n$1,900\nView Item \nFree Shipping\nNew Item\nPizza Box 220-220-40 mm\n$430\nView Item \nNew Item\nPizza Box 260-260-40 mm\n$440\nView Item \nNew Item\nPizza Box 280-280-40 mm\n$490\nView Item \nNew Item\nPizza Box 300-300-40 mm\n$525\nView Item \nNew Item\nPizza Box 320-320-40 mm\n$625\nView Item \nNew Item\nPizza Box 330-330-40 mm\n$640\nView Item \nNew Item\nPizza Box 400-400-35 mm\n$550\nView Item \nNew Item\nZelve Grande 13 HP Honda Engine Inflation Fan-84 cm (Worldwide Shipping with DHL Express)\n$1,875\nView Item \nFree Shipping\nNew Item\nZelve Tall 13 HP Honda Engine Inflation Fan-74 cm (Worldwide Shipping with DHL Express)\n$1,771\nView Item \nFree Shipping\nNew Item\n‹\n›\nSee Details\nSee Details\nSee Details\n\n \n\n \n\n \n\n \n\n \n\n \n\nDeals\nZaxe Z1 Plus 3D Printer (Worldwide Free Shipping with Fedex)\n$4,850\nView Item \nFree Shipping\nNew Item\nItem on Offer\nVW SKODA AUDI SEAT A1-IBIZA-FABIA-ROOMSTER-POLO-RAPID SPACEBACK TURBO HOSE INTERCOOLER 6R0145832E (World Wide Free Shipping)\n$29\nView Item \nFree Shipping\nNew Item\nItem on Offer\nVW SKODA AUDI SEAT ALTEA-A3-LEON-TOLEDO-GOLF PLUS-GOLF V-OCTAVIA-SUPERB-PASSAT TURBO HOSE INTERCOOLER 3C0145828C (World Wide Free Shipping)\n$36\nView Item \nFree Shipping\nNew Item\nItem on Offer\nVibrope Walnut, Pecan, Olive, Plum, Almond, Chestnut, Apricot, Mulberry Cherry and Apple Tree Harvester (Worldwide Shipping with Fedex)\n$1,450\n$1,525\nView Item \n%5 Sale\n%5Sale\nFree Shipping\nNew Item\nItem on Offer\nvitrinurunler\nOut of stock\nPneumatic Press PEAB20\n$0\nNew Item\nZaxe X2 3D Printer (Worldwide Free Shipping with Fedex)\n$1,900\nView Item \nFree Shipping\nNew Item\nVW AUDI PASSAT B5-A4-A6 AVANT 1.9 TDI INTERCOOLER TURBO HOSE PIPE 058145856A (Worldwide Free Shipping)\n$31\nView Item \nFree Shipping\nNew Item\nManuel Grape Crush-Stalk Remover\n$500\nView Item \nNew Item\nCKK200 Walnut Cracking Machine with Calibration\n$3,532\nView Item \nNew Item\nTwist1400L Walnut Screening and Calibration Machine\n$8,334\nView Item \nNew Item\nRENAULT MEGANE III 1.5 dCi FLUENCE TURBO HOSE INTERCOOLER 144602487R-1 (World Wide Free Shipping)\n$31\nView Item \nFree Shipping\nNew Item\nJoker JF 380 Fiber Inflatable Boat\n$5,417\nView Item \nNew Item\nOut of stock\n6000E Case Type Walnut Drying Machine\n$8,855\nNew Item\nJoker JF 420 PST Fiber Inflatable Boat\n$7,709\nView Item \nNew Item\nAUDI A4 TURBO HOSE INTERCOOLER 8E0145790P (World Wide Free Shipping)\n$36\nView Item \nFree Shipping\nNew Item\nNANO Weed Herbicide Spraying Attachment High Quality Nozzles (World Wide Shipping by Fedex)\n$468\nView Item \nFree Shipping\nNew Item\nVibrope Master Walnut, Pecan, Chestnut, Plum, Almond, Chestnut, Apricot, Mulberry Cherry and Apple Tree Shaker (World Wide Shipping with Fedex)\n$1,950\n$2,000\nView Item \n%2 Sale\n%2Sale\nFree Shipping\nNew Item\nECO Interrow Hoer Carrier Chasis\n$2,550\nView Item \nNew Item\nOut of stock\nVW AUDI Q7-TOUAREG-SHARAN TURBO HOSE 7L6145738A (World Wide Free Shipping)\n$41\nFree Shipping\nNew Item\nTransparent Face Protection Mask with Fascia (World Wide Shipping by Fedex)\n$7\nView Item \nNew Item\nMagnum 2 – 2 Meter Double Drum With Brush, Horizontal Walnut Hulling Machine\n$7,292\nView Item \nNew Item\nBoost 1900Z Hollow, Rotten, Cracked Walnut Sorting Machine (Without Conveyor,Industrial)\n$3,021\nView Item \nNew Item\nOut of stock\nManuel Big Stainless-Steel Fruit Crusher\n$0\nNew Item\nOut of stock\nSmall Stainless-Steel Fruit Crusher with Electric Motor\n$573\nNew Item\n      \nLet Us Help You\nYour Orders\nSales Agreement\nPrivacy\nReturns & Replacements\nWarranty\n \nCustomer Relations\nHelp\nFrequently Asked Questions\nGet to Know Us\nAbout Bati Export\nContact\nTurkey-Discover The Potantial\n\n Stay up tuned \n\nSend\n \n  \n\n \n\n© 2022 Batı Export. All Rights Reserved"
    }
  },
  {
    "productID": 12,
    "manufacturer_id": "468599",
    "url": "https://carolinastorage.com",
    "extractedData": {
      "textData": "Locations\nAbout\nAccess of Wilmington\nResources\nContact Us\nPay Bill\nCarolina Storage at Walla...\nRent now\nLocations\nAbout\nAccess of Wilmington\nResources\nContact Us\nPay Bill\nRent now\nNorth Carolina’s Affordable Self Storage Choice\nThe area’s best bargain on storage units\nCheck our locations\nThe Best Value in Self Storage\n\nFinding great self storage doesn’t need to break the bank. Our storage units are some of the more affordable options in the area while offering a modern and well-maintained self storage experience.\n\nAffordable Storage Units\nSelf storage that fits your budget\nClean and Safe\nOur self storage facilities are well-maintained\nExcellent Customer Service\nYou are our number one priority, and we want you to know it\nVideo Recording\nStorage units are protected by 24/7 recording\nLocally Owned and Operated\nWe understand and care about our communities\nClimate-Controlled Storage Units\nProtect your items with our climate-controlled units\nOur Fabulous Storage Units Are Available at Carolina Storage at Wallace - Annex\nFind my location\n\"Absolutely the best storage near me in Wilmington! Clean and well managed with a very decent price. Head down there and speak to Tom if you are looking for storage in Wilmington!\"\n\nMartin Espley,10/01/21\n\nNorth Market at Carolina Storage\n\n\"Best storage place in town by far! Highly recommend. Mike is the best\"\n\nThompson Schollaert,09/01/24\n\nNorth Market at Carolina Storage\n\nNina Lisk,10/01/19\n\nCarolina Storage at Judges Road\n\n\"A great value at a great location. We will be their customers for a long time.\"\n\nJud Watkins,11/01/23\n\nCarolina Storage at Judges Road\n\n\"Great temperature controlled storage but over priced.\"\n\nChase Driesbaugh,10/01/19\n\nCarolina Storage at Judges Road\n\n\"Have a friend who moved into Wilmington recently and was grateful for the pricing on storage. He said Tom was great, and that everyone there was genuinely helpful. Thanks to all!\"\n\nMonty Hobson,10/01/21\n\nNorth Market at Carolina Storage\n\nLocal Self Storage with Heart\n\nWe provide our communities with more than storage units. At Carolina Storage, we are committed to our local communities. \n\nWe strive to provide affordable storage units in Wilmington, making self storage as accessible as possible. When you rent a storage unit here, you also contribute to giving back to the community! \n\nWe proactively give time, money, and resources to uphold our social responsibilities in the Wilmington area. For the past nine years, we have done this in various ways, such as giving to Access of Wilmington and Wounded Warriors.\n\nView our locations\nStorage Units to Fit Your Budget\n\nTimes are tough, but self storage should be easy. Carolina Storage provides superior self storage at some of the cheapest rates in the area. \nFrom climate-controlled units to large vehicle parking, we have everything you need. Our flexible storage options are perfect for businesses, students, and residential clients alike. \n\n\nRent now\nOur Locations\nCarolina Storage at Wallace - Annex\nNC\n106 East Boney Street\nWallace, NC 28466\n8,313 mi\nCarolina Storage at Spring Lake\nNC\n620 Shell Drive\nSpring Lake, NC 28390\n8,313 mi\nCarolina Storage at Raeford\nNC\n231 Gridley Lane\nRaeford, NC 28376\n8,328 mi\nSee more\nOffice closed\nOpens at 8:00 AM\nLocations\n\nRaeford\n\nJudges Road\n\nNorth Market\n\nSpring Lake\n\nWallace\n\nCompany\n\nHome\n\nAbout Us\n\nContact\n\nPay Bill\n\nResources\n\nTestimonials\n\nACCESS of Wilmington\n\nFAQs\n\nStorage Tips\n\nSize Guide\n\nPrivacy policy\n\nMade with\n\nby StoragePug"
    }
  },
  {
    "productID": 13,
    "manufacturer_id": "489199",
    "url": "https://amzimporting.com",
    "extractedData": {
      "textData": "Skip to main content\nHome\nServices\nStart New\nGrow an Existing Business\nSourcing Trips\nWhy Amazon\nProduct Sourcing Success\nFAQs\nCONTACT\nfacebook\nlinkedin\ninstagram\nCart\nClose Cart\nAn All-Inclusive Resource for Building an Amazon Business\nStart and grow your online business with confidence. Change your lifestyle. Get expert one-on-one Amazon expert mentoring, product sourcing support, proven systems for success, and more!\nStart NewGrow an existing store\nOne-on-One Amazon Expert Mentoring and Support\n6,750,000\nGenerated by our First Time Sellers\n340\nNew Amazon Brands Launched\nProduct Sourcing and China Importing Success\n15\nYears of Importing Experience\n200,000,000\nWorth of Products Sourced\nWhat We Do\nNo flashy seminars or overpriced video tutorials here. We provide real one-on-one support for those who are serious about changing their lifestyle. No experience required!\nLearn more about Amazon and why it’s the perfect place to build a successful business.\nWhy Amazon\nSTART\n\nWe specialize in helping new Amazon entrepreneurs with the mentoring and support they need to start a successful business. Finding and evaluating product ideas, Amazon account and listing creation, barcode and shipment generation, advertising and branding strategy, and MUCH more!\n\nSOURCE\n\nOur USA and Asia Sourcing offices will use their 17 years of experience to work for you and your business. Helping you enjoy better quality products, better prices, and peace of mind. All while saving time and avoiding costly mistakes.\n\nLAUNCH\n\nOur team specializes in getting your products ranked and selling well. Through advanced software analytics, listing content creation, keyword optimization, promotional launches, PPC, photography, social media, and more!\n\nGROW\n\nWe provide Amazon account monthly management solutions for existing and growing businesses. Our team will take over every aspect of your Amazon account. Saving you time, helping you generate more sales, and helping you crush your competition.\n\nReal Reviews. Real Success.\nHere are just some of the things our clients are saying:\nContact Us\n\n“This is not an “online” course or a series of “flashy” videos; these are “real people” who themselves are successful Amazon sellers. We have been clients for 18 months and have even met with them in China. Each member of the team is a expert in their field; and together they are willing to share their knowledge and expertise to help sellers grow their brand on Amazon.”\n\nFazila\nAustralia\n\n“I have always seen ideas and been entrepreneurial, but never trusted any person or website enough to actually throw money at an idea. Not to mention my lack of time. I ran into these guys by chance and I couldn't be happier. My first product is selling over 25 units per day! I can call this team anytime and they are always there to help one-on-one. They really are great.”\n\nAdam\nUSA\n\n“Last month I made $51,897 selling products on Amazon and online. I have 4 daughters under the age of 13, so I wanted something I could do from home. When I started, I didn't know anything about importing or websites or even how to sell on Amazon. AMZ Importing can help you with all of that.”\n\nRachel\nAustralia\n\n“I signed up for the mentoring package and it easily paid for itself just on my first order of products. I saved tons of time, got better quality and pricing, saved hundreds with their importing connections, got an optimized listing, etc. I get help again on future products too. This is a no brainer.”\n\nJohn\nUSA\n\n“With the support and guidance from AMZ Importing's one-on-one Amazon specialists and their China office I have successfully launched a product on Amazon and have been increasing sales daily!! Sold $1500 yesterday. I thought launching a product would be simple, but I honestly couldn’t do it without them! They have all the right resources available for success. They are awesome and are always there to assist!”\n\nVar\nUSA\n\n“From day one, we felt that we have been taken care of and that there are multiple people helping us make our products succeed. Their contacts in China are beyond valuable. Knowing that you are working with legitimate factories making quality products, because you need good reviews to succeed on Amazon. I see their services as a \"must have\" for new AND experienced sellers.”\n\nMelanie & Dave\nUSA\nThe Other Guys\nFlashy “get rich quick” seminars and webinars. Lamborghini pictures, beach videos, and unrealistic promises. These “gurus” have a goal to sell as many students as possible.\nYou are paying $2500+ for access to video courses. Full support packages like ours can cost well over $30,000!\nLess than 5% of their paid students actually end up getting a product to Amazon or starting a real business.\nNo one-on-one Amazon expert mentoring and support. They just simply offer video training or online groups.\nNo product sourcing help in Asia or importing support. You are left on your own to find good suppliers, deal with China, negotiate, run inspections, import, arrange shipments, and more.\nWe are successful Amazon sellers and importers who work with clients that are serious about building a long-term, successful online business. We bring on a limited amount of clients each month, as we work with you every step of the way!\nOur most popular package costs only $2895!\nWe have the absolute highest client success rate in the industry. Every single one of our engaged clients will get products to Amazon, achieve sales, and build a real business.\nOur Amazon expert team is here to support and mentor you one-on-one via web meetings, phone calls, and email support.\nOur product sourcing office is our core business! There is no one else like us. Our expert staff in the USA and Asia will help you find the best suppliers, prices, and quality out there. They are there on the ground working for you and your business!\nAsia Sourcing Office Support\nYou need someone on the ground working for you!\nWhat we offer is truly unique. We don’t just leave you on your own when it comes to sourcing and importing your products. Each of our clients get exclusive access to our dedicated sourcing team for help and assistance!\nWith ongoing mentoring and access to our USA and Asia sourcing offices, you can rest assured that you are not alone in this process.\nImporting from China and other parts of Asia is not as easy as it might seem. In fact, it has taken us over 15 years to find the right formula, the right staff, and the right partners. The crucial part of making it all work is having an office in Asia with local negotiators at our disposal, along with Chinese speaking USA staff. They find the most trustworthy factories, get the best possible prices, ensure the quality is correct, and make sure everything runs smoothy.\nLearn More\nSell More with a Strong Brand!\nBuild your legacy and create a valuable brand that you are proud of. Our experts will show you how.\nThe best long-term opportunity on Amazon comes from having your own unique brand… not re-selling individual items, or selling cheap unbranded products. Whether you pursue private label products, slightly custom products, or fully custom products .. our team will help you achieve your goals. What will you create?\nStart YOUR path to growth, and achieve your goals, with one of our START NEW packages below.\nStarter Package\nIndividuals and small teams\n2 one-on-one web meeting trainings with Amazon Expert during the first 30 days\nPremium Access to insider step-by-step guide, checklists, tips & tricks\nRecorded video content and recorded trainings\n6 months of premium product sourcing and importing support\nAbility to upgrade package at any time during the first 6 months\n$ 995\nOne Time Payment\nSelect\nLearn More\nMentoring Package\nGrowing businesses\nScheduled one-on-one web meeting trainings with your dedicated Amazon Expert during each important stage of the process\nPremium Access to insider step-by-step guide, checklists, tips & tricks\nRecorded video content and recorded trainings\nUnlimited Premium Amazon expert support via email for 2 years from choosing a product idea to getting your first sale.\nUnlimited Assistance from our Asia and USA product sourcing teams to help you source and import your products\n$500 credit toward first product sourced\nAbility to upgrade package at any time during the first 6 months\n$ 3995\nPayment Options Available\nSelect\nLearn More\nMost Popular\nPlatinum Mentoring Package\nAdvanced companies\nScheduled one-on-one web meeting trainings with your dedicated Amazon Expert during each important stage of the process\nPremium Access to insider step-by-step guide, checklists, tips & tricks\nRecorded video content and recorded trainings\nUnlimited Premium Amazon expert support via email for 2 years from choosing a product idea to getting your first sale.\nUnlimited Assistance from our Asia and USA product sourcing teams to help you source and import your products\n$1000 credit toward first product sourced\nShopify store creation and full integration to the Amazon platform.\n\nSocial media set up and brand strategy, launch, and 2 months of professional content creation, bi-weekly posting, blog posts, and access to premium social media training content.\n\nFull Amazon Account Management and Marketing Launch for your 1st Amazon Product including:\nProfessional Product Photography + Graphics\nListing and content created and keyword optimized by professional copyrighter\nAmazon PPC setup, Marketing Launch, and 2 Months of Full Account Management\n$ 11995\nPayment Options Available\nSelect\nLearn More\nBest Value\nWant to Grow an Existing Amazon Store?\nFor existing businesses and brands, we offer account management, marketing assistance, launch packages, and more.\nLearn More\nDid you know that our clients can sell on other platforms in addition to Amazon?\nMany of our most successful clients leverage our China support to import and sell products on Kickstarter, eBay, Jet, Walmart.com, Facebook, Shopify, websites, retailers, and more!\nWe help you build your Amazon business, but you own your products and business 100%. There are many ways you can make money with our China importing assistance if you think big! We help you import as many products as you want to.\nBuilding an Amazon business with us could be for you if:\nYou want a change in lifestyle, want to work for yourself, and want to work from anywhere!\nYou are looking for a side hustle or passion project!\nYou are looking to replace your 9-5 income over time, but you understand that real success doesn’t happen overnight.\nYou are wanting to build a scalable business and create your own brand!\nBuilding an Amazon business with us isn’t likely for you if:\nYou aren’t willing to learn, be mentored, or take any small risks.\nYou are looking for a get rich quick or push-button opportunity that requires no effort.\nYou are looking for someone else to make you successful.\nYou are a dreamer and not a doer.\nHave a question? Think you would be a good fit to work with us? Want more information? Reach out today!\nSend us a message here anytime. Also check out our comprehensive FAQ page for more information.\nUSA OFFICE\n470 W 220 S, Suite 102\nPleasant Grove, Utah 84062\nUSA\nCall 385.200.0176\nASIA OFFICE\n7A15 Shanghai Uni-President Plaza\nNo. 568 West Tianshan Road\nChangning District\nShanghai China 200335\nAUSTRALIA OFFICE\n3/30 Park Road\nMulgrave NSW 2756\nAustralia\nSend Us a Message\nName*\nFirst\n \nLast\nEmail*\nPhone*\nWhat are you interested in?\nMake a selection\nStarting a new Amazon business\nGrowing an existing Amazon business\nChina Support only\nOther\nMake a selection\nWhere are you located?\nSend Us A Message*\nHome\nServices\nStart New\nGrow an Existing Business\nSourcing Trips\nWhy Amazon\nProduct Sourcing Success\nFAQs\nCONTACT\n\n© 2025 AMZ Importing. AMZ Importing LLC and the services offered on this site are not directly associated, affiliated, endorsed, or sponsored by Amazon, Inc\n\nfacebook\nlinkedin\ninstagram\nClose Menu"
    }
  },
  {
    "productID": 14,
    "manufacturer_id": "264241",
    "url": "https://kyvernatx.com",
    "extractedData": {
      "textData": "Platform & Pipeline\nPatients\nInside Kyverna\nEducation & Events\nInvestors\nNews\nCareers\nContact\n    \nWe Develop\nLife Changing Medicines\nfor Patients Living With Autoimmune Diseases\nOur mission is to bring life-changing therapeutic benefits to patients living with autoimmune diseases.\nOUR OPPORTUNITY\nA new era of CAR T-cell therapy\n\nKyverna is pioneering CAR T-cell therapies for autoimmune disease patients by harnessing the power of T cells to achieve a potentially sustained treatment-free remission by resetting the immune system.\n\nOUR PLATFORM & PIPELINE\nBringing the transformational experience of cell therapies to autoimmune diseases\n\nWe believe the success of CAR T-cell therapies in B cell-driven hematological malignancies can be leveraged to deliver therapeutic benefits in patients living with autoimmune diseases.\n\nA patient-centric approach\n\nWe are a patient-centered, clinical-stage biopharmaceutical company with active, ongoing clinical trials for multiple autoimmune diseases at different locations across the world.\n\nHow does CAR T-cell therapy work?\n\nCell therapy holds the potential to reset the immune system after a single infusion, aimed at achieving long-lasting, treatment-free remission.\n\n01: Patient’s blood is collected and white blood cells (including T cells) are separated.\n\n02: T cells are altered so that they can recognize, attack, and destroy the B cells.\n\n03: Altered T cells are returned back to the patient via an intravenous infusion.\n\n04: The CAR T cells attack B cells, including unhealthy B cells with the goal of helping to control, reduce, or reverse the disease.\n\n05: The aim is for the body to replenish with its own healthy B cells.\n\nTHE EXPERIENCE\nTHERAPY\n\nChimeric antigen receptor (CAR) T-cell therapies\n\nFORMAT\n\nAutologous (KYV-101) and allogeneic\n(KYV-201)\n\nDISEASE TARGET\n\nB cell-driven autoimmune diseases\n\nCLINICAL TRIALS\n\nLupus nephritis Systemic sclerosis Myasthenia gravis Multiple sclerosis\nStiff-person syndrome\n\nClinical trials\n\nParticipation in clinical trials is the best way to access our investigational product. Kyverna may consider requests for expanded access when alternative therapy options have been exhausted.\n\nHOW TO PARTICIPATE\nLINKS\nHome\nPlatform & Pipeline\nPatients\nInside Kyverna\nEducation & Events\nInvestors\nCareers\nContact\nABOUT\n\nKyverna is a patient-centered, clinical-stage biopharmaceutical company focused on developing cell therapies for patients suffering from autoimmune diseases.\n\nOur lead CAR T-cell therapy candidate, KYV-101 is advancing through clinical development with sponsored clinical trials across two broad areas of autoimmune disease: rheumatology and neurology, including Phase 2 trials for stiff-person syndrome, multiple sclerosis, and myasthenia gravis, a Phase 1/2 trial for systemic sclerosis, and two ongoing multi-center, open-label Phase 1/2 trials in the United States and Germany for patients with lupus nephritis.\n\nKyverna’s pipeline includes next-generation chimeric antigen receptor (CAR) T-cell therapies in both autologous and allogeneic formats with properties intended to be well suited for use in B cell-driven autoimmune diseases.\n\nFOLLOW US ON SOCIAL\nPrivacy Policy (US) Privacy Policy (EU/UK)\n\n© 2025 Kyverna Therapeutics, Inc. All rights reserved."
    }
  },
  {
    "productID": 15,
    "manufacturer_id": "463539",
    "url": "https://calysta.com",
    "extractedData": {
      "textData": "Skip to content\nMEDIA\nCAREERS\nJOURNAL\nCONTACTS\nTwitter\n \nLinkedin-in\nMARKETS\nSUSTAINABILITY\nOUR PROCESS\nWHO WE ARE\nSustainable protein ingredients for feed and food\nFish and Livestock\nPets\nFood Ingredients\n\nCalysta is a world leader in cellular agriculture, creating protein without limits via a patented fermentation platform that uses no arable land, plant or animal products.\n\nTwitter\n \nLinkedin-in\nNewsletter\n   Subscribe\n\n©2024 CALYSTA INC. ALL RIGHTS RESERVED​\n\nPRIVACY POLICY   |   TERMS & CONDITIONS   |   (650) 492-6880   |  &NBSPINFO@CALYSTA.COM"
    }
  }
]